In [1]:
import pandas as pd

In [5]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
import pandas as pd
pd.Series([10,88,33,44,55])

0    10
1    88
2    33
3    44
4    55
dtype: int64

In [7]:
seri = pd.Series([10,88,33,44,55])

In [8]:
type(seri)

pandas.core.series.Series

In [10]:
seri.axes # index bilgilere ulasmak icin

[RangeIndex(start=0, stop=5, step=1)]

In [11]:
seri.dtype

dtype('int64')

In [12]:
seri.size

5

In [14]:
seri.ndim # boyut sayisi

1

In [16]:
seri.values # elemanlarini getirir

array([10, 88, 33, 44, 55], dtype=int64)

In [18]:
seri.head # serinin ilk 5 elemanini bilgilerini getirir default olarak

<bound method NDFrame.head of 0    10
1    88
2    33
3    44
4    55
dtype: int64>

In [19]:
seri.head(3) # serinin ilk 3 eleman bilgilerini getirir

0    10
1    88
2    33
dtype: int64

In [20]:
seri.tail(3)  # serini son 3 elemanini getirir default degeri 5

2    33
3    44
4    55
dtype: int64

In [21]:
# index isimlendirmesi

In [22]:
pd.Series([190,288,233,434,554])

0    190
1    288
2    233
3    434
4    554
dtype: int64

In [23]:
pd.Series([190,288,233,434,554] , index=[1,3,5,7,9,])

1    190
3    288
5    233
7    434
9    554
dtype: int64

In [26]:
seri = pd.Series([190,288,233,434,554] , index=['a','b','c','d','e'])

In [27]:
seri['a']

190

In [28]:
seri['a':'c']

a    190
b    288
c    233
dtype: int64

In [29]:
#sozluk uzerinden liste olusturmak

In [30]:
sozluk = pd.Series({'reg':111,'log':222,'cart':333})

In [31]:
sozluk

reg     111
log     222
cart    333
dtype: int64

In [32]:
sozluk = {'reg':111,'log':222,'cart':333}

In [33]:
seri = pd.Series(sozluk)

In [34]:
seri

reg     111
log     222
cart    333
dtype: int64

In [35]:
# iki seriyi birlestirmek seri olusturma (concat)

In [36]:
pd.concat([seri,seri])

reg     111
log     222
cart    333
reg     111
log     222
cart    333
dtype: int64

# Eleman Islemleri

In [38]:
import numpy as np
import pandas as pd

In [39]:
a = np.array([11,22,33,44,55])
seri = pd.Series(a)
seri

0    11
1    22
2    33
3    44
4    55
dtype: int32

In [40]:
seri[0]

11

In [41]:
seri[0:3]

0    11
1    22
2    33
dtype: int32

In [43]:
seri = pd.Series([121,232,343,545], index=['reg','loj','cart','rf'])

In [44]:
seri

reg     121
loj     232
cart    343
rf      545
dtype: int64

In [45]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [47]:
seri.keys

<bound method Series.keys of reg     121
loj     232
cart    343
rf      545
dtype: int64>

In [48]:
list(seri.items())

[('reg', 121), ('loj', 232), ('cart', 343), ('rf', 545)]

In [49]:
seri.items  # item (maddeleri)

<bound method Series.iteritems of reg     121
loj     232
cart    343
rf      545
dtype: int64>

In [51]:
seri.values #degerleri gormek icin kullanilri

array([121, 232, 343, 545], dtype=int64)

In [52]:
# eleman sorgulama

In [53]:
'reg' in seri

True

In [54]:
'a' in seri

False

In [55]:
#fancy eleman

In [56]:
seri[['rf','reg']]

rf     545
reg    121
dtype: int64

In [57]:
seri['reg']

121

In [58]:
seri['reg']=130

In [59]:
seri['reg']

130

In [60]:
seri['reg':'loj']

reg    130
loj    232
dtype: int64

# pandas DataFrame Olusturma

In [61]:
import pandas as pd

In [62]:
l=[1,2,39,45,67,87]

In [63]:
l

[1, 2, 39, 45, 67, 87]

In [65]:
pd.DataFrame(l,columns=['degisken_ismi'])

   degisken_ismi
0              1
1              2
2             39
3             45
4             67
5             87

In [66]:
import numpy as np

In [72]:
m = np.arange(1,10).reshape((3,3))

In [73]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [75]:
pd.DataFrame(m, columns = ['var1', 'var2','var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [76]:
# df isimlendirme

In [78]:
df=pd.DataFrame(m, columns = ['var1', 'var2','var3'])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [79]:
df.columns =['deg1','deg2','deg3']
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [80]:
type(df)

pandas.core.frame.DataFrame

In [82]:
df.axes # axes bize satir ve sutun bilgilerini veririr

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [83]:
df.shape

(3, 3)

In [84]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [85]:
type(df.values) #elemanlari array olarak gosterir

numpy.ndarray

In [86]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

In [87]:
a = np.array([1,2,3,4,5])

In [89]:
pd.DataFrame(a, columns=['deg1'])

   deg1
0     1
1     2
2     3
3     4
4     5

# Eleman Islemleri

In [90]:
import  numpy as np
import pandas as pd

In [91]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [92]:
sozluk = {'var1':s1,'var2':s2, 'var3':s3}

In [93]:
sozluk

{'var1': array([2, 2, 2, 1, 5]),
 'var2': array([6, 9, 0, 6, 8]),
 'var3': array([9, 3, 9, 8, 6])}

In [94]:
df = pd.DataFrame(sozluk)

In [95]:
df

   var1  var2  var3
0     2     6     9
1     2     9     3
2     2     0     9
3     1     6     8
4     5     8     6

In [96]:
df[0:1]

   var1  var2  var3
0     2     6     9

In [97]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [98]:
df.index= [ 'a','b','c','d','e']

In [99]:
df

   var1  var2  var3
a     2     6     9
b     2     9     3
c     2     0     9
d     1     6     8
e     5     8     6

In [101]:
df['a':'c']

   var1  var2  var3
a     2     6     9
b     2     9     3
c     2     0     9

In [102]:
#silme

In [104]:
df.drop('a' , axis = 0)   #axis 0 oolunca satir bazinda siler ve silme islemi o anlik gecerlidir
                            # yani df dataframe de silinmedi

   var1  var2  var3
b     2     9     3
c     2     0     9
d     1     6     8
e     5     8     6

In [113]:
df   # drop fonksiyonuny ile anliksilme gerceklesmisdi

   var1  var2  var3
b     2     9     3
c     2     0     9
d     1     6     8
e     5     8     6

In [116]:
df.drop('b' , axis = 0 , inplace = True)   # inplace true olunca satiri
                                            #gercek zamanli silmis oldujk
df

   var1  var2  var3
c     2     0     9
d     1     6     8
e     5     8     6

In [117]:
df

   var1  var2  var3
c     2     0     9
d     1     6     8
e     5     8     6

In [118]:
# fancy

In [119]:
l=['c','e']

In [120]:
df.drop(l, axis=0)  # listtenin icindeki elemanlara gore sildik

   var1  var2  var3
d     1     6     8

In [121]:
# degiskenler icin

In [122]:
df

   var1  var2  var3
c     2     0     9
d     1     6     8
e     5     8     6

In [123]:
'var1' in df

True

In [124]:
l=['var1','var4','var2']

In [125]:
for i in l:
    print(i in df)

True
False
True

In [126]:
df

   var1  var2  var3
c     2     0     9
d     1     6     8
e     5     8     6

In [127]:
df['var1']

c    2
d    1
e    5
Name: var1, dtype: int32

In [128]:
df['var4'] =  df['var1']/ df['var2']

In [129]:
df

   var1  var2  var3      var4
c     2     0     9       inf
d     1     6     8  0.166667
e     5     8     6  0.625000

In [130]:
# degisken silme

In [131]:
df.drop('var4' ,axis=1)   # var4 gecici sildik

   var1  var2  var3
c     2     0     9
d     1     6     8
e     5     8     6

In [132]:
df

   var1  var2  var3      var4
c     2     0     9       inf
d     1     6     8  0.166667
e     5     8     6  0.625000

In [137]:
df.drop('var4', axis=1, inplace= True)   # var4 gercek zamanli sildik

KeyError: "['var4'] not found in axis"

In [138]:
l=['var1','var2']

In [139]:
df.drop(l, axis=1)

   var3
c     9
d     8
e     6

# Gozlem ve Degisken Secimi : loc & iloc

In [140]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m , columns= ['var1', 'var2','var3'])
df

   var1  var2  var3
0    27    11     7
1    11    25    25
2     6    12    17
3     6    29     9
4    20    13    11
5     5     7     7
6    13    17    13
7     8    28    29
8    21    15    25
9    12     8    26

In [141]:
# loc : tanimlandigi sekliyle ile secim yapmak icin kulanilir

In [143]:
df.loc[0:3]

   var1  var2  var3
0    27    11     7
1    11    25    25
2     6    12    17
3     6    29     9

In [144]:
# iloc : alisik oldugumuz indeksleme mantigiyla secim  yapar

In [145]:
df.iloc[0:3]

   var1  var2  var3
0    27    11     7
1    11    25    25
2     6    12    17

In [146]:
df.iloc[0,0]

27

In [147]:
df.iloc[:3,:2]

   var1  var2
0    27    11
1    11    25
2     6    12

In [148]:
df.loc[0:3 , 'var3']  # degiskenleri secnek icin log kullanilir

0     7
1    25
2    17
3     9
Name: var3, dtype: int32

In [149]:
df.iloc[0:3 , 'var3']  # degiskenleri secmek icin loc kullanilir

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [150]:
df.iloc[0:3]['var3']   # iloc kullanacaksak bu sekilde kullanabiliriz

0     7
1    25
2    17
Name: var3, dtype: int32

# kosullu Eleman Islemleri

In [151]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m , columns= ['var1', 'var2','var3'])
df

   var1  var2  var3
0    12     8     5
1    26     2    16
2    20    25    19
3    10    13    13
4    15    23    10
5    19    21    20
6     1     3    12
7     3    11     6
8     7    27    19
9     6     7    15

In [152]:
df['var1']

0    12
1    26
2    20
3    10
4    15
5    19
6     1
7     3
8     7
9     6
Name: var1, dtype: int32

In [153]:
df['var1'][0:1]

0    12
Name: var1, dtype: int32

In [154]:
df[2:5]

   var1  var2  var3
2    20    25    19
3    10    13    13
4    15    23    10

In [155]:
df[82:5]['var1','var2'] # bu sekilde olmaz fancy yapmaliyiz yani listeye koymaliyiz

KeyError: ('var1', 'var2')

In [157]:
df[2:5][['var1','var2']] # bu sekilde olmaz fancy yapmaliyiz yani listeye koymaliyiz
                            # listeye koydugumuz icin calisir

   var1  var2
2    20    25
3    10    13
4    15    23

In [158]:
df

   var1  var2  var3
0    12     8     5
1    26     2    16
2    20    25    19
3    10    13    13
4    15    23    10
5    19    21    20
6     1     3    12
7     3    11     6
8     7    27    19
9     6     7    15

In [159]:
df.var1

0    12
1    26
2    20
3    10
4    15
5    19
6     1
7     3
8     7
9     6
Name: var1, dtype: int32

In [161]:
df[df.var1>15]   # var1 deki 15 den buyuk sayilar

   var1  var2  var3
1    26     2    16
2    20    25    19
5    19    21    20

In [163]:
df[(df.var1>15) & (df.var3<20)]

   var1  var2  var3
1    26     2    16
2    20    25    19

In [164]:
df[(df.var1>15) , ['var1','var2']]  # loc kullan

TypeError: '(0    False
1     True
2     True
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: var1, dtype: bool, ['var1', 'var2'])' is an invalid key

In [166]:
df.loc[(df.var1>15) , ['var1','var2']]

   var1  var2
1    26     2
2    20    25
5    19    21

In [169]:
df[(df.var1>15)][['var1','var2']] # fancy yapildi

   var1  var2
1    26     2
2    20    25
5    19    21

# Birlestirme (Join) Islemleri

In [172]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(5,3))
df1 = pd.DataFrame(m , columns= ['var1', 'var2','var3'])
df1

   var1  var2  var3
0    21     2    23
1     1    21     1
2    16    21     7
3     3    17     2
4    10     5    15

In [173]:
df2= df1 +99

In [174]:
df2

   var1  var2  var3
0   120   101   122
1   100   120   100
2   115   120   106
3   102   116   101
4   109   104   114

In [176]:
pd.concat([df1,df2]) # birlesti ama index numaralari ayni kaldi 
                        # ignore_index=False default degeri olduggu icin

   var1  var2  var3
0    21     2    23
1     1    21     1
2    16    21     7
3     3    17     2
4    10     5    15
0   120   101   122
1   100   120   100
2   115   120   106
3   102   116   101
4   109   104   114

In [179]:
?pd.concat

Signature:
pd.concat(
    objs,
    axis=0,
    join='outer',
    join_axes=None,
    ignore_index=False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity=False,
    sort=None,
    copy=True,
)
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series, DataFrame, or Panel objects
    If a dict is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis(es)
join_axes : list of Index objects
    Specific indexes to use for the other n - 1 axes instead of performing
    inner/outer set logic
ignore_index : boolean, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys
names : list, default None
    Names for the levels in the resulting hierarchical index
verify_integrity : boolean, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation
sort : boolean, default None
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'. The current default of sorting is deprecated and will
    change to not-sorting in a future version of pandas.

    Explicitly pass ``sort=True`` to silence the warning and sort.
    Explicitly pass ``sort=False`` to silence the warning and not sort.

    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0

copy : boolean, default True
    If False, do not copy data unnecessarily

Returns
-------
concatenated : object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append
DataFrame.append
DataFrame.join
DataFrame.merge

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<http://pandas.pydata.org/pandas-docs/stable/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2',])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\dell\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [180]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0    21     2    23
1     1    21     1
2    16    21     7
3     3    17     2
4    10     5    15
5   120   101   122
6   100   120   100
7   115   120   106
8   102   116   101
9   109   104   114

In [182]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [183]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [184]:
df2.columns= ['var1','var2','deg1']

In [185]:
df2

   var1  var2  deg1
0   120   101   122
1   100   120   100
2   115   120   106
3   102   116   101
4   109   104   114

In [189]:
pd.concat([df1,df2])  # uyari

C:\Users\Dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg1  var1  var2  var3
0    NaN    21     2  23.0
1    NaN     1    21   1.0
2    NaN    16    21   7.0
3    NaN     3    17   2.0
4    NaN    10     5  15.0
0  122.0   120   101   NaN
1  100.0   100   120   NaN
2  106.0   115   120   NaN
3  101.0   102   116   NaN
4  114.0   109   104   NaN

In [191]:
pd.concat([df1,df2] , join='inner') # kesisimleerine gore birlesti
                                        # join turune gore birlestiler

   var1  var2
0    21     2
1     1    21
2    16    21
3     3    17
4    10     5
0   120   101
1   100   120
2   115   120
3   102   116
4   109   104

In [193]:
pd.concat([df1,df2] , join_axes = [df1.columns])  # df1 deki degiskenlere gore birles

   var1  var2  var3
0    21     2  23.0
1     1    21   1.0
2    16    21   7.0
3     3    17   2.0
4    10     5  15.0
0   120   101   NaN
1   100   120   NaN
2   115   120   NaN
3   102   116   NaN
4   109   104   NaN

In [195]:
pd.concat([df1,df2] , join_axes = [df2.columns] , ignore_index=True)  #df2 deki degiskenlere gore birles

   var1  var2   deg1
0    21     2    NaN
1     1    21    NaN
2    16    21    NaN
3     3    17    NaN
4    10     5    NaN
5   120   101  122.0
6   100   120  100.0
7   115   120  106.0
8   102   116  101.0
9   109   104  114.0

# Ileri Birlestirme Islemleri

In [196]:
import pandas as pd

In [197]:
# birebir birlestirme

In [198]:
df1 = pd.DataFrame({'caliskanler':['Ali','Veli','Ayse','Fatma'],
                   'grup':['Muhasebe','Muhendislik','Muhendislik','IK']})
df1

  caliskanler         grup
0         Ali     Muhasebe
1        Veli  Muhendislik
2        Ayse  Muhendislik
3       Fatma           IK

In [199]:
df2 = pd.DataFrame({'caliskanler':['Ali','Veli','Ayse','Fatma'],
                  'ilk_giris':[2000,2009,2014,2019]})
df2

  caliskanler  ilk_giris
0         Ali       2000
1        Veli       2009
2        Ayse       2014
3       Fatma       2019

In [200]:
pd.merge(df1,df2)  # ortak bir sutun varsa kullanilirt

  caliskanler         grup  ilk_giris
0         Ali     Muhasebe       2000
1        Veli  Muhendislik       2009
2        Ayse  Muhendislik       2014
3       Fatma           IK       2019

In [203]:
pd.merge(df1,df2, on = 'caliskanler')

  caliskanler         grup  ilk_giris
0         Ali     Muhasebe       2000
1        Veli  Muhendislik       2009
2        Ayse  Muhendislik       2014
3       Fatma           IK       2019

In [204]:
df3 = pd.merge(df1,df2)
df3

  caliskanler         grup  ilk_giris
0         Ali     Muhasebe       2000
1        Veli  Muhendislik       2009
2        Ayse  Muhendislik       2014
3       Fatma           IK       2019

In [207]:
df4 = pd.DataFrame({'grup': ['Muhasebe','Muhendislik','IK'],
                   'mudur':['Caner', 'Mustafa', 'Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [208]:
pd.merge(df3,df4)

  caliskanler         grup  ilk_giris    mudur
0         Ali     Muhasebe       2000    Caner
1        Veli  Muhendislik       2009  Mustafa
2        Ayse  Muhendislik       2014  Mustafa
3       Fatma           IK       2019  Berkcan

In [209]:
# coktan coka

In [211]:
df5 = pd.DataFrame({'grup':['Muhasebe' ,'Muhasebe','Muhendislik','Muhendislik','IK','IK'] , 
                   'yetenekler':['matematik','excel','kodlama','linux','excel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [212]:
pd.merge(df1,df5) # hercaisanin yeteneklerini gosteri

  caliskanler         grup yetenekler
0         Ali     Muhasebe  matematik
1         Ali     Muhasebe      excel
2        Veli  Muhendislik    kodlama
3        Veli  Muhendislik      linux
4        Ayse  Muhendislik    kodlama
5        Ayse  Muhendislik      linux
6       Fatma           IK      excel
7       Fatma           IK    yonetim

# Toplulastirma ve Gruplama (Aggregation&Grouping)
## Basit Toplulastirma Fonksiyonlari
### . count()
### . first()
### . last()
### . mean()
### . Median()
### . min()
### . max()
### . std()
### . var()
### . sum()

In [214]:
import seaborn as sns

In [215]:
df=sns.load_dataset('planets')

In [217]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load a dataset from the online repository (requires internet).

Parameters
----------
name : str
    Name of the dataset (`name`.csv on
    https://github.com/mwaskom/seaborn-data).  You can obtain list of
    available datasets using :func:`get_dataset_names`
cache : boolean, optional
    If True, then cache data locally and use the cache on subsequent calls
data_home : string, optional
    The directory in which to cache data. By default, uses ~/seaborn-data/
kws : dict, optional
    Passed to pandas.read_csv
File:      c:\users\dell\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [218]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [219]:
df.shape

(1035, 6)

In [220]:
df.mean()  # Ortalama

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [221]:
df.mean('mass')

ValueError: No axis named mass for object type <class 'type'>

In [223]:
df['mass'].mean()   # once islem yapacagimiz kismi seciyoruz

2.6381605847953233

In [224]:
df['mass'].sum()

1353.37638

In [225]:
df['mass'].std()

3.8186166509616046

In [226]:
df['mass'].var()

14.58183312700122

In [228]:
df.describe()   # datasetinin istatiksel bilgilerini getirir sutun sutun

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [230]:
df.describe().T   # transpozunu aldi yani satir ve sutunlarin yeri degisti

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [232]:
df.dropna().describe().T # eksik degerleri sil ve ona gore tekrar degerlendir dedik

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [233]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'veri':[10,11,52,23,43,55]}, columns= ['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [234]:
df.groupby('gruplar') # grupladi

In [235]:
df.groupby('gruplar').mean() # once grupla sonra toplu islem yap (aggretion)

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [236]:
df.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [237]:
import seaborn as sns
df=sns.load_dataset('planets')
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [238]:
df.groupby('method')

In [240]:
df.groupby('method')['orbital_period'].mean() # method degiskenine gore grupladi
                                                #orbital_period	 degiskenine gore islem yapacak
                                                # mean islemi ortalama almaya yarar

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [241]:
df.groupby('method')['mass'].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [243]:
df.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# Ileri Toplulastirma Islemleri
### . Aggregate() : toplu islemlerde 
### . filter()
### . transform()
### . apply()

In [244]:
import pandas as pd
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [245]:
# aggregate : toplu islem

In [246]:
df.groupby('gruplar').mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [248]:
df.groupby('gruplar').aggregate(['min', np.median ,'max'])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [249]:
df.groupby('gruplar').aggregate({'degisken1':'min','degisken2':'max'})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [250]:
#filter

In [251]:
import pandas as pd
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [252]:
def filter_func(x):
    return x['degisken1'].std()>9

In [253]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [256]:
# Transform : donusturme

In [255]:
import pandas as pd
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [257]:
df['degisken1']*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [258]:
df_a = df.iloc[:,1:3]

In [259]:
df_a.transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [260]:
df_a.transform(lambda x: (x-x.mean())/ x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [261]:
# apply : gezinir ve toplulastirir

In [268]:
import pandas as pd
df = pd.DataFrame({
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['degisken1','degisken2'])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [263]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2028
dtype: object

In [269]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [270]:
import pandas as pd
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [271]:
df.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

# Pivot Tablolar

In [1]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

C:\Users\Dell\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\Dell\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\Dell\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 216, got 192
  return f(*args, **kwds)
C:\Users\Dell\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [2]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head

<bound method NDFrame.head of      survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
5           0       3    male   NaN  ...   NaN   Queenstown     no   True
6           0       1    male  54.0  ...     E  Southampton     no   True
7           0       3    male   2.0  ...   NaN  Southampton     no  False
8           1       3  female  27.0  ...   NaN  Southampton    yes  False
9           1       2  female  14.0  ...   NaN    Cherbourg    yes  False
10          1       3  female   4.0  ...     G  Southampton    yes  False
11          1       1  female  58.0  ...     C  Southampton    yes   True
12          0       3    male  20.0  ...   NaN  Southampton     no   True
13          0       3    male  39.0  ...   NaN  Southampton     no  False
14          0       3  female  14.0  ...   NaN  Southampton     no   True
15          1       2  female  55.0  ...   NaN  Southampton    yes   True
16          0       3    male   2.0  ...   NaN   Queenstown     no  False
17          1       2    male   NaN  ...   NaN  Southampton    yes   True
18          0       3  female  31.0  ...   NaN  Southampton     no  False
19          1       3  female   NaN  ...   NaN    Cherbourg    yes   True
20          0       2    male  35.0  ...   NaN  Southampton     no   True
21          1       2    male  34.0  ...     D  Southampton    yes   True
22          1       3  female  15.0  ...   NaN   Queenstown    yes   True
23          1       1    male  28.0  ...     A  Southampton    yes   True
24          0       3  female   8.0  ...   NaN  Southampton     no  False
25          1       3  female  38.0  ...   NaN  Southampton    yes  False
26          0       3    male   NaN  ...   NaN    Cherbourg     no   True
27          0       1    male  19.0  ...     C  Southampton     no  False
28          1       3  female   NaN  ...   NaN   Queenstown    yes   True
29          0       3    male   NaN  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
861         0       2    male  21.0  ...   NaN  Southampton     no  False
862         1       1  female  48.0  ...     D  Southampton    yes   True
863         0       3  female   NaN  ...   NaN  Southampton     no  False
864         0       2    male  24.0  ...   NaN  Southampton     no   True
865         1       2  female  42.0  ...   NaN  Southampton    yes   True
866         1       2  female  27.0  ...   NaN    Cherbourg    yes  False
867         0       1    male  31.0  ...     A  Southampton     no   True
868         0       3    male   NaN  ...   NaN  Southampton     no   True
869         1       3    male   4.0  ...   NaN  Southampton    yes  False
870         0       3    male  26.0  ...   NaN  Southampton     no   True
871         1       1  female  47.0  ...     D  Southampton    yes  False
872         0       1    male  33.0  ...     B  Southampton     no   True
873         0       3    male  47.0  ...   NaN  Southampton     no   True
874         1       2  female  28.0  ...   NaN    Cherbourg    yes  False
875         1       3  female  15.0  ...   NaN    Cherbourg    yes   True
876         0       3    male  20.0  ...   NaN  Southampton     no   True
877         0       3    male  19.0  ...   NaN  Southampton     no   True
878         0       3    male   NaN  ...   NaN  Southampton     no   True
879         1       1  female  56.0  ...     C    Cherbourg    yes  False
880         1       2  female  25.0  ...   NaN  Southampton    yes  False
881         0       3    male  33.0  ...   NaN  Southampton     no   True
882         0       3  female  22.0  ...   NaN  Southampton     no   True
883         0       2    male  28.0  ...   NaN  Southampton     no   True
884         0       3    male  25.0  ...   NaN  Southampton     no   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]>

In [4]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [5]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [7]:
titanic.groupby(['sex','class'])[['survived']].aggregate('mean').unstack()  #unstack: hiyarasik index yapisi olur

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [8]:
titanic.groupby(['sex','class'])[['survived']].aggregate('mean')  #unstack: hiyarasik index yapisi olur

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [9]:
# pivot ile table

In [10]:
titanic.pivot_table('survived', index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [13]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [14]:
age = pd.cut(titanic['age'],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [16]:
titanic.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# Dis Kaynakli Veri Okuma

In [17]:
 import pandas as pd

In [20]:
pd.read_csv('reading_data/ornekcsv.csv')  # sorun sep in default degeri ,

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [19]:
pd.read_csv('reading_data/ornekcsv.csv', sep=';')  # sorun sep in default degeri ,

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [21]:
# txt okuma

In [22]:
pd.read_csv('reading_data/duz_metin.txt')  # sorun  olmadi sep in default degeri , ama burada boslukda kabul etti

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [23]:
pd.read_excel('reading_data/ornekx.xlsx')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [24]:
df = pd.read_excel('reading_data/ornekx.xlsx')

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [28]:
df.columns=('A','B','C')  # columns isimlerini degistirdi
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [29]:
# sifirdan txt okuma
tips = pd.read_csv('reading_data/data.txt')
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

# Bonus:Problem Cozme ve Dokuman Okuma Kulturu

# Quiz 22,23

In [30]:
#Question 2:
#Pandas dataframe'i zerinde hem gzlem hem deiken seimi iin index bamsz seim yapmak zere .... kullanlr.
#cevap iloc